## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 31 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                    |
|--------|-----------------------------------------------------------------------------------------------------------|
| add    | `module.feedback_cronjob_vpc.aws_cloudwatch_log_group.flow_logs[0]`                                       |
|        | `module.feedback_cronjob_vpc.aws_default_network_acl.default`                                             |
|        | `module.feedback_cronjob_vpc.aws_default_route_table.default`                                             |
|        | `module.feedback_cronjob_vpc.aws_default_security_group.default`                                          |
|        | `module.feedback_cronjob_vpc.aws_eip.nat[0]`                                                              |
|        | `module.feedback_cronjob_vpc.aws_flow_log.flow_logs[0]`                                                   |
|        | `module.feedback_cronjob_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                        |
|        | `module.feedback_cronjob_vpc.aws_iam_role.flow_logs[0]`                                                   |
|        | `module.feedback_cronjob_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]` |
|        | `module.feedback_cronjob_vpc.aws_internet_gateway.gw`                                                     |
|        | `module.feedback_cronjob_vpc.aws_nat_gateway.nat_gw[0]`                                                   |
|        | `module.feedback_cronjob_vpc.aws_network_acl.main`                                                        |
|        | `module.feedback_cronjob_vpc.aws_network_acl_rule.block_rdp[0]`                                           |
|        | `module.feedback_cronjob_vpc.aws_network_acl_rule.block_ssh[0]`                                           |
|        | `module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_egress_443[0]`                            |
|        | `module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`                  |
|        | `module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`              |
|        | `module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]`        |
|        | `module.feedback_cronjob_vpc.aws_route.private_nat_gateway[0]`                                            |
|        | `module.feedback_cronjob_vpc.aws_route.public_internet_gateway`                                           |
|        | `module.feedback_cronjob_vpc.aws_route_table.private[0]`                                                  |
|        | `module.feedback_cronjob_vpc.aws_route_table.public`                                                      |
|        | `module.feedback_cronjob_vpc.aws_route_table_association.private[0]`                                      |
|        | `module.feedback_cronjob_vpc.aws_route_table_association.private[1]`                                      |
|        | `module.feedback_cronjob_vpc.aws_route_table_association.public[0]`                                       |
|        | `module.feedback_cronjob_vpc.aws_route_table_association.public[1]`                                       |
|        | `module.feedback_cronjob_vpc.aws_subnet.private[0]`                                                       |
|        | `module.feedback_cronjob_vpc.aws_subnet.private[1]`                                                       |
|        | `module.feedback_cronjob_vpc.aws_subnet.public[0]`                                                        |
|        | `module.feedback_cronjob_vpc.aws_subnet.public[1]`                                                        |
|        | `module.feedback_cronjob_vpc.aws_vpc.main`                                                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.feedback_cronjob_vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.feedback_cronjob_vpc.aws_cloudwatch_log_group.flow_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "feedback-cronjob_flow_logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob_vpc.aws_default_network_acl.default will be created
  + resource "aws_default_network_acl" "default" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_default_nacl"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_default_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = []
      + tags                   = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
          + "name"       = "feedback-cronjob_default_route_table"
        }
      + tags_all               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
          + "name"       = "feedback-cronjob_default_route_table"
        }
      + vpc_id                 = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_default_sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_default_sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob-eip0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob-eip0"
          + "Terraform"  = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_flow_log.flow_logs[0] will be created
  + resource "aws_flow_log" "flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be created
  + resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for writing flow logs in CloudWatch"
      + id               = (known after apply)
      + name             = "VpcMetricsFlowLogsWrite"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob_vpc.aws_iam_role.flow_logs[0] will be created
  + resource "aws_iam_role" "flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-cronjob_flow_logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "feedback-cronjob_flow_logs"
    }

  # module.feedback_cronjob_vpc.aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_internet_gateway"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_internet_gateway"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob-natgw-0"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob-natgw-0"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob_vpc.aws_network_acl.main will be created
  + resource "aws_network_acl" "main" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_main_nacl"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_main_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id     = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_network_acl_rule.block_rdp[0] will be created
  + resource "aws_network_acl_rule" "block_rdp" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 3389
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 51
      + to_port        = 3389
    }

  # module.feedback_cronjob_vpc.aws_network_acl_rule.block_ssh[0] will be created
  + resource "aws_network_acl_rule" "block_ssh" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 50
      + to_port        = 22
    }

  # module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_egress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 60
      + to_port        = 443
    }

  # module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_egress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 61
      + to_port        = 65535
    }

  # module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 62
      + to_port        = 443
    }

  # module.feedback_cronjob_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 63
      + to_port        = 65535
    }

  # module.feedback_cronjob_vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.feedback_cronjob_vpc.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.feedback_cronjob_vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_private_route_table_0"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_private_route_table_0"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_public_route_table"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_public_route_table"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_private_subnet_ca-central-1a"
          + "Terraform"  = "true"
          + "Tier"       = "Private"
        }
      + tags_all                                       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_private_subnet_ca-central-1a"
          + "Terraform"  = "true"
          + "Tier"       = "Private"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "40m"
        }
    }

  # module.feedback_cronjob_vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_private_subnet_ca-central-1b"
          + "Terraform"  = "true"
          + "Tier"       = "Private"
        }
      + tags_all                                       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_private_subnet_ca-central-1b"
          + "Terraform"  = "true"
          + "Tier"       = "Private"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "40m"
        }
    }

  # module.feedback_cronjob_vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.128/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_public_subnet_ca-central-1a"
          + "Terraform"  = "true"
          + "Tier"       = "Public"
        }
      + tags_all                                       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_public_subnet_ca-central-1a"
          + "Terraform"  = "true"
          + "Tier"       = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.192/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_public_subnet_ca-central-1b"
          + "Terraform"  = "true"
          + "Tier"       = "Public"
        }
      + tags_all                                       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_public_subnet_ca-central-1b"
          + "Terraform"  = "true"
          + "Tier"       = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.feedback_cronjob_vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_vpc"
          + "Terraform"  = "true"
        }
      + tags_all                             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Name"       = "feedback-cronjob_vpc"
          + "Terraform"  = "true"
        }
    }

Plan: 31 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_cidr_block         = "10.0.0.0/16"
  + vpc_id                 = (known after apply)
  + vpc_private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
